import React from "react";
import PressureStats from "../Pressure";
import PulseStats from "../Pulse";

export default function Month({period}: {period?: "day" | "week" | "month"}) {
  return (
    <>
      <PressureStats
        labels={["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30"]}
        datasets={[{ data1: [120, 130, 125, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180], data2: [80, 95, 104, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150] }]}
        percentage1={120}
        percentage2={80}
        analytics={
          "На протяжении месяца ваше среднее давление было стабильным. Систолическое немного выше нормы, но диастолическое находится в пределах допустимого. Рекомендуется отдохнуть и пить больше воды. В целом состояние нормальное."
        }
      />
      <PulseStats
        labels={["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30"]}
        datasets={[{ data: [75, 80, 62, 70, 68, 74, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123] }]}
        percentage={72}
        analytics={
          "Ваш пульс на протяжении месяца был в норме. Рекомендуется продолжать следить за уровнем активности и отдыхать при необходимости."
        }
        period={period}
      />
    </>
  );
}
